export const SPECIAL_WORDS = {
  /* 特殊文字のしりとり用変換マップ */
  shiritoriPronunciationMap: {
    "２": "ツー",
    Ｚ: "ゼット",
    "♂": "オス",
    "♀": "メス",
    ァ: "ア",
    ィ: "イ",
    ゥ: "ウ",
    ェ: "エ",
    ォ: "オ",
    ャ: "ヤ",
    ュ: "ユ",
    ョ: "ヨ",
    ヮ: "ワ",
  } as { [key: string]: string },

  /* しりとりの最後の文字として扱えない文字リスト */
  notLastWordList: ["ー", "：", "・", "ッ"] as string[],

  /* 表記揺れマップ */
  spellingFixMap: {
    "(ポリゴン)2": "$1２",
    "(ポリゴン)z|Z|ｚ": "$1Ｚ",
    "(ニドラン)オス": "$1♂",
    "(ニドラン)メス": "$1♀",
    "(タイプ):?(ヌル)": "$1：$2",
    "(カプ)(コケコ|レヒレ|ブルル|テテフ)": "$1・$2",
  } as { [key: string]: string },
} as const;
